app/controllers/wing_orders_controller.rb

SELECT "wing_orders".* FROM "wing_orders"
---
  def index
    @wing_orders = WingOrder.all

SELECT "flavors".* FROM "flavors"
---
  def new
    @wing_order = WingOrder.new
    @state_collection = WingOrder::STATES
    @quantity_collection = WingOrder::QUANTITIES
    @flavor_collection = Flavor.all

SELECT "flavors".* FROM "flavors" WHERE "flavors"."id" IN ($1, $2, $3)  [["id", nil], ["id", 2], ["id", 3]]
INSERT INTO "order_flavors" ("wing_order_id", "flavor_id") VALUES ($1, $2) RETURNING "id"  [["wing_order_id", 6], ["flavor_id", 2]]
INSERT INTO "wing_orders" ("customer_name", "city", "state", "quantity", "ranch_dressing") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["customer_name", "Patrick Whelan"], ["city", "Saugus"], ["state", "MA"], ["quantity", 10], ["ranch_dressing", true]]
SELECT "flavors".* FROM "flavors"
---
  def create
    @wing_order = WingOrder.new(wing_order_params)
    @wing_order.flavors = Flavor.where(id: params[:wing_order][:flavor_ids])

    if @wing_order.save
      flash[:notice] = "Wing order created!"
      redirect_to wing_orders_path
    else
      flash[:alert] = "Wing order not created"
      @state_collection = WingOrder::STATES
      @quantity_collection = WingOrder::QUANTITIES
      @flavor_collection = Flavor.all

SELECT  "wing_orders".* FROM "wing_orders" WHERE "wing_orders"."id" = $1 LIMIT $2  [["id", 26], ["LIMIT", 1]]
SELECT "flavors".* FROM "flavors"
---
  def edit
    @wing_order = WingOrder.find(params[:id])
    @state_collection = WingOrder::STATES
    @quantity_collection = WingOrder::QUANTITIES
    @flavor_collection = Flavor.all